======
Family + EOF
======

Family
---------------

(root (family (name_desc (name))))

======
Family + Family + EOF
======

Family

Family
---------------

(root
  (family (name_desc (name)))
  (family (name_desc (name)))
)

======
Relation + EOF
======

Family

Name = Name
---------------

(root
  (family
    (name_desc
      (name))
    (relations
      (relation
        (sources
          (name))
        (targets
          (name_desc
            (name)))))))


======
Relation + Family + EOF
======

Family

Name = Name

Family
---------------

(root
  (family
    (name_desc
      (name))
    (relations
      (relation
        (sources
          (name))
        (targets
          (name_desc
            (name))))))
  (family
    (name_desc
      (name))))

