======
Family + EOF
======

Family
---------------

(root (family (name_def (name))))

======
Family + Family + EOF
======

Family

Family
---------------

(root
  (family (name_def (name)))
  (family (name_def (name)))
)

======
Relation + EOF
======

Family

Name = Name
---------------

(root
  (family
    (name_def
      (name))
    (relations
      (relation
        (sources (name_ref (name)))
        (targets
          (name_def
            (name)))))))


======
Relation + Family + EOF
======

Family

Name = Name

Family
---------------

(root
  (family
    (name_def
      (name))
    (relations
      (relation
        (sources (name_ref (name)))
        (targets
          (name_def
            (name))))))
  (family
    (name_def
      (name))))

