
========
relations one
========

Family

Name0 = Name1 (Name2)

---------

(root
  (family
    (name_desc
      (name))
    (relations
      (relation
        (sources (name))
        (targets
          (name_desc
            (name)
            (name_aliases (name))
          ))))))


========
relations without targets
========

Family

Name0 =

---------

(root
  (family
    (name_desc
      (name))
    (relations
      (relation
        (sources (name))
      ))))


========
relations many
========

Family (Fam1)

Name0 = Name1 (Name2)

Name0 = Name1 (Name2, Name-3)

---------

(root
  (family
    (name_desc
      (name)
      (name_aliases (name))
    )
    (relations
      (relation
        (sources
          (name))
        (targets
          (name_desc
            (name)
            (name_aliases (name)))))

      (relation
        (sources
          (name))
        (targets
          (name_desc
            (name)
            (name_aliases (name) (name)))))
    )
))


========
relations many names
========

Family (Fam1, Fam-Fam)

Name, Name-Nam = Name1 (Nam-2, Nam), Name2 (Nam2)

---------

(root
  (family
    (name_desc
      (name)
      (name_aliases (name) (name))
    )
    (relations
      (relation
        (sources (name) (name))
        (targets
          (name_desc
            (name)
            (name_aliases (name) (name)))
          (name_desc
            (name)
            (name_aliases (name)))))
    )
))

========
relations many + family
========

Family

Name0 = Name1 (Name2)

Name0 = Name1 (Name2)

Family

Name0 = Name1 (Name2)

---------

(root
  (family
    (name_desc
      (name))
    (relations
      (relation
        (sources
          (name))
        (targets
          (name_desc
            (name)
            (name_aliases
              (name)))))

      (relation
        (sources
          (name))
        (targets
          (name_desc
            (name)
            (name_aliases
              (name)))))
    )
  )
  (family
    (name_desc
      (name))
    (relations
      (relation
        (sources
          (name))
        (targets
          (name_desc
            (name)
            (name_aliases
              (name)))))
    )
  )
)

========
relations many + only name
========

Family

Name0 = Name1 (Name2)

Name0 = Name1 (Name2)

Family

---------

(root
  (family
    (name_desc
      (name))
    (relations
      (relation
        (sources
          (name))
        (targets
          (name_desc
            (name)
            (name_aliases
              (name)))))

      (relation
        (sources
          (name))
        (targets
          (name_desc
            (name)
            (name_aliases
              (name)))))
    )
  )
  (family
    (name_desc
      (name))
  )
)



========
relations with words as join
========

Family

Name0 and Name - word

---------

(root
  (family
    (name_desc (name))
    (relations
      (relation
        (sources (name) (name))
        (words)
      )
    )
  )
)

========
relations with words as join + Name
========

Family

Name0 and Name - Name and Name

---------

(root
  (family
    (name_desc (name))
    (relations
      (relation
        (sources (name) (name))
        (targets
          (name_desc (name))
          (name_desc (name))
        )
      )
    )
  )
)


========
relation names with new line
========

Family

Name + Name =
Name (Alias)
Name

Name + Name = word
Name, Name
Name (Alias) and Name

Name - word
Name and Name

---------

(root
  (family
    (name_desc (name))
    (relations
      (relation
        (sources (name) (name))
        (targets
          (name_desc
            (name)
            (name_aliases (name)))
          (name_desc (name))
        )
      )
      (relation
        (sources (name) (name))
        (words)
        (targets
          (name_desc (name))
          (name_desc (name))
          (name_desc
            (name)
            (name_aliases (name)))
          (name_desc (name))
        )
      )
      (relation
        (sources (name))
        (words)
        (targets
          (name_desc (name))
          (name_desc (name))
        )
      )
    )
  )
)

