
========
relations one
========

Family

Name0 = Name1 (Name2)

---------

(root
  (family
    (name_def
      (name))
    (relations
      (relation
        (sources (name_ref (name)))
        (targets
          (name_def
            (name)
            (name_aliases (name))
          ))))))


========
relations without targets
========

Family

Name0 =

---------

(root
  (family
    (name_def
      (name))
    (relations
      (relation
        (sources (name_ref (name)))
      ))))


========
relations many
========

Family (Fam1)

Name0 = Name1 (Name2)

Name0 = Name1 (Name2, Name-3)

---------

(root
  (family
    (name_def
      (name)
      (name_aliases (name))
    )
    (relations
      (relation
        (sources (name_ref (name)))
        (targets
          (name_def
            (name)
            (name_aliases (name)))))

      (relation
        (sources (name_ref (name)))
        (targets
          (name_def
            (name)
            (name_aliases (name) (name)))))
    )
))


========
relations many names
========

Family (Fam1, Fam-Fam)

Name, Name-Nam = Name1 (Nam-2, Nam), Name2 (Nam2)

---------

(root
  (family
    (name_def
      (name)
      (name_aliases (name) (name))
    )
    (relations
      (relation
        (sources (name_ref (name)) (name_ref (name)))
        (targets
          (name_def
            (name)
            (name_aliases (name) (name)))
          (name_def
            (name)
            (name_aliases (name)))))
    )
))

========
relations many + family
========

Family

Name0 = Name1 (Name2)

Name0 = Name1 (Name2)

Family

Name0 = Name1 (Name2)

---------

(root
  (family
    (name_def
      (name))
    (relations
      (relation
        (sources (name_ref (name)))
        (targets
          (name_def
            (name)
            (name_aliases
              (name)))))

      (relation
        (sources (name_ref (name)))
        (targets
          (name_def
            (name)
            (name_aliases
              (name)))))
    )
  )
  (family
    (name_def
      (name))
    (relations
      (relation
        (sources (name_ref (name)))
        (targets
          (name_def
            (name)
            (name_aliases
              (name)))))
    )
  )
)

========
relations many + only name
========

Family

Name0 = Name1 (Name2)

Name0 = Name1 (Name2)

Family

---------

(root
  (family
    (name_def
      (name))
    (relations
      (relation
        (sources (name_ref (name)))
        (targets
          (name_def
            (name)
            (name_aliases
              (name)))))

      (relation
        (sources (name_ref (name)))
        (targets
          (name_def
            (name)
            (name_aliases
              (name)))))
    )
  )
  (family
    (name_def
      (name))
  )
)



========
relations with words as join
========

Family

Name0 and Name - word

---------

(root
  (family
    (name_def (name))
    (relations
      (relation
        (sources (name_ref (name)) (name_ref (name)))
        (words)
      )
    )
  )
)

========
relations with words as join + Name
========

Family

Name0 and Name - Name and Name

---------

(root
  (family
    (name_def (name))
    (relations
      (relation
        (sources (name_ref (name)) (name_ref (name)))
        (targets
          (name_def (name))
          (name_def (name))
        )
      )
    )
  )
)


========
relation names with new line
========

Family

Name + Name Fam? =
Name (Alias)
Name

Name + Name = word
Name, name?
Name (Alias) and Name

Name - word
Name and Name

Family2

Name + Name Fam =
1. Name
2. (Sur) Name
3. girl?

---------

(root
  (family
    (name_def (name))
    (relations
      (relation
        (sources
          (name_ref (name))
          (unknown)
        )
        (targets
          (name_def
            (name)
            (name_aliases (name)))
          (name_def (name))
        )
      )
      (relation
        (sources (name_ref (name)) (name_ref (name)))
        (words)
        (targets
          (name_def (name))
          (unknown)
          (name_def
            (name)
            (name_aliases (name)))
          (name_def (name))
        )
      )
      (relation
        (sources (name_ref (name)))
        (words)
        (targets
          (name_def (name))
          (name_def (name))
        )
      )
    )
  )

  (family
    (name_def (name))
    (relations
      (relation
        (sources
          (name_ref (name))
          (name_ref (name) (name))
        )
        (targets
          (name_def (num) (name))
          (name_def (num) (new_surname (name)) (name))
          (num_unknown (num) (unknown))
        )
      )
    )
  )
)



========
relation names with new surname
========

Family

Name + Name? =
(Surname) Name (Alias)
(Surname) Name
Name

---------

(root
  (family
    (name_def (name))
    (relations
      (relation
        (sources
          (name_ref (name))
          (unknown)
        )
        (targets
          (name_def
            (new_surname (name))
            (name)
            (name_aliases (name)))
          (name_def
            (new_surname (name))
            (name))
          (name_def
            (name))
        )
      )
    )
  )
)



========
relation names with comments
========

Family
# some desc
# some desc

Name + ? =
(Surname) Name (Alias)
# some (random) - ? = text
(Surname) Name
* other крилик # asd / asd
?
// test
// two

Fam

---------

(root
  (family
    (name_def (name))
    (comment)
    (comment)
    (relations
      (relation
        (sources
          (name_ref (name))
          (unknown)
        )
        (targets
          (name_def
            (new_surname (name))
            (name)
            (name_aliases (name)))
          (comment)
          (name_def
            (new_surname (name))
            (name))
          (comment)
          (unknown)
          (comment)
          (comment)
        )
      )
    )
  )

  (family
    (name_def (name))
  )
)

